plaussie/MTM_RTOS/FreeRTOS/Demo/ARM7_LPC2129_Keil_RVDS/main.c
#include <lpc21xx.h>
#include "FreeRTOS.h"
#include "task.h"
#include "queue.h"
#include "semphr.h"
#include "led.h"
#include "servo.h"
#include "string.h"
#include "keyboard.h"

void Keyboard(void *pvParameters){
	
	enum KeyboardState ePreviousState, eCurrentState = RELASED;
	
	while(1){
		ePreviousState = eCurrentState;
		eCurrentState = eKeyboardRead();
		if(ePreviousState != eCurrentState){
			switch(eCurrentState){
				case BUTTON_0: ServoCallib();
					break;
				case BUTTON_1: ServoGoTo(50);
					break;
				case BUTTON_2: ServoGoTo(100);
					break;
				case BUTTON_3: ServoGoTo(150);
					break;
				default:
					break;
			}
			vTaskDelay(100);
		}
	}
}

int main( void ){
	TickType_t ServoPeriod = 10;
	KeyboardInit();
	ServoInit();
	xTaskCreate(Keyboard, NULL, 128, NULL, 2, NULL);
	xTaskCreate(ServoRun, NULL, 128, &ServoPeriod, 2, NULL);
	vTaskStartScheduler();
	while(1);
}
